/*
Дадени се еден четирицифрен и еден трицифрен број. Да се пресмета аритметичка средина на броевите кои се наоѓаат на парните позииции на трицифрениот број и на непарните позиции на четирицифрениот број. 

Напомена: Под парни позиции се смета и нултата позиција. 

пр. за бројот 2468 на нулта позиција е бројот 2, на прва позиција е бр 4, на втора бр 6 и на трета бр 8.

*/

#include <iostream>

using namespace std;

int main()
{
    int a,b,suma;
    cin>>a>>b;
    suma=((a/100)%10)+(a%10)+((b/100)%10)+((b%10));
    double aritmeticka=suma/4.0;

    cout<<aritmeticka;
    return 0;
}
