/*
Да се провери дали одреден внесен шестцифрен број е симетричен. Тоа значи првата цифра на бројот да е еднаква со последната, втората цифра со претпоследната… Пример за симетрични броеви: 123321, 805508, 999999. Да се испечати 1 ако е симетричен, 0 ако не е симетричен.
*/

#include <iostream>

using namespace std;

int main()
{
    int broj,a,b,c,d,e,f;
    cin>>broj;
    a=(broj/100000)%10;
    b=(broj/10000)%10;
    c=(broj/1000)%10;
    d=(broj/100)%10;
    e=(broj/10)%10;
    f=broj%10;
    
    if ((a==f)&&(b==e)&&(c==d))
    {
        cout<<"1";
    }
    else 
    {
        cout<<"0";
    }
    return 0;
}
