/*
Да се напише програма каде од стандарден влез се внесува еден 5 цифрен број. Програмата печати 1 доколку бројот е специјален, а 0 во спротивно.

Еден број е специјален доколку за него важи дека е делив со збирот на својата втора и трета цифра и првата,третата и петтата цифра се во строго 
растечки редослед.

Да се внимава на делење со 0, т.е. да се испечати -1 во таков случај.
*/

#include <iostream>

using namespace std;

int main()
{
    int broj,a,b,c,d,e;
    cin>>broj;
    
    a=(broj/10000)%10; //1  tuj
    b=(broj/1000)%10; // 2 tuj 
    c=(broj/100)%10; //3 tuj
    d=(broj/10)%10; 
    e=broj%10; //5 tuj
    
    int zbir=b+c;
    if (zbir ==0 )
    {
        cout<<"-1";
    }
   else  if(broj%zbir==0 && (a<b) && (b<c) && (c<d) && (d<e))
    {
        cout<<"1"<<endl;
    }
    else
    {
        cout<<"0";
    }
    return 0;
}
