/*
Да се напише програма што ќе ја испечати сумата на сите броеви деливи со 3 и не делливи со 2 во интервалот [A,B). А и B се внесуваат од тастатура.

Објаснување на примерот.

А=10, B = 20. Броеви кои припаѓаат во интервалот се 10,11,12,13,..,19. Од нив деллив со 3 а не деллив со 2 е бројот 15, па сумата е 15. 
*/

#include <iostream>

using namespace std;

int main()
{
    int A,B,suma=0;
    cin>>A>>B;
    for(int i=A;i<B;i++)
    {
        if(i%3==0)
        suma+=i;
    }
    cout<<suma;
}
