/*
На ФИНКИ е време за упис на нови студенти. За студент да се упиши, треба да пристигне на факултетот пред 9 часот и да чека ред за да биде услужен од студентска служба. 
Студентска служба почнува со работа од 9 часот, работи 2 часа, прави пауза 30 минути, работи 1 час, прави пауза 30 минути, работи 2 часа и нејзиното работно време завршува.

На студентска служба и е потребно точно 5 минути да услужи 1 студент.

Ваша задача е, ако знаете кој по ред е одреден студент во редицата за чекање, 
да го испечатете времето во часови и минути кое тој го чека за да биде услужен или да испечати на стандарден излез доколку студентот не е услужен.
*/
#include <iostream>

using namespace std;

int main()
{
    int student;
    int pocetok = 9;
    int kraj;
    cin>>student;
    int minuti,cas,pauza;
    minuti=(student*5)-5;
    if(minuti>=60)
    {
        cas=minuti/60;
        minuti%=60;
        if(cas>=2)
        {
            minuti+=30; // prva pauza
            if(cas>=3)
            {
                minuti+=30;
                kraj=pocetok+cas;
            }
        }
    }
    if(kraj>=14)
    {
        cout<<"Studentskata sluzba zavrsila"<<endl;
    }
    else
    {
        cout<<"Hours: "<<cas <<", minutes: "<<minuti<<endl;
    }
}

